Tekla.Structures.Solid.FaceEnumerator
The FaceEnumerator class is used to enumerate the faces of a solid.

Tekla.Structures.Solid.FaceEnumerator.#ctor(System.Collections.Generic.List{System.Collections.Generic.List{System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}}},System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t},System.Collections.Generic.List{System.Int32},System.Collections.Generic.List{Tekla.Structures.Identifier})
Instantiates a new face enumerator. This constructor should
only be called by someone inheriting from ISolid.
Faces: The faces.
Normals: The normals.
ShellIndices: The shell indices.
OriginPartIds: The origin part ids.

Tekla.Structures.Solid.FaceEnumerator.#ctor(System.Collections.Generic.List{Tekla.Structures.Solid.Face})
Instantiates a new face enumerator. This constructor should
only be called by someone inheriting from ISolid.
Faces: The faces to enumerate.

Tekla.Structures.Solid.FaceEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Solid.FaceEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Solid.FaceEnumerator.Current
Returns the current face.

Tekla.Structures.Solid.FaceEnumerator.System#Collections#IEnumerator#Current
Returns the current face.